[
    {
        "tag": "billing_issue",
        "patterns": [
            "Why was I charged extra this month?",
            "I don't understand the roaming fees on my bill.",
            "Can you explain the late payment penalty?",
            "My bill shows a charge I never made.",
            "I'm being billed for services I cancelled.",
            "There’s a mysterious $10 fee—what is it for?",
            "Why is my data overage cost so high?",
            "I was promised a discount but it’s not on my invoice.",
            "Please remove the international call charge from my bill.",
            "My bill is higher than usual, can you check it?",
            "I was double‑charged for my last payment.",
            "The tax amount on my statement looks incorrect.",
            "I need help with the confusing line item labeled ‘service fee’.",
            "Why did my bill jump after the plan upgrade?",
            "I was told my plan includes unlimited texts, but I see a charge.",
            "Can you waive the reconnection fee?",
            "My credit card was declined, but I see a pending charge.",
            "I was promised a promotional rate that isn’t applied.",
            "The bill shows a charge for a device I never received.",
            "I’m being billed for family members I don’t have.",
            "Why is there a late fee even though I paid on time?",
            "I need a breakdown of the equipment rental fees.",
            "My bill includes a charge for a service I never used.",
            "I was charged for a number porting fee that should be free.",
            "The bill says I owe $0, but I got a collection notice.",
            "Can you clarify the surcharge on my monthly fee?",
            "I see a charge for a premium number I didn’t order.",
            "My bill reflects a previous balance that I already paid.",
            "Why was my plan downgrade not reflected in the bill?",
            "I was billed for a data boost I never activated.",
            "The invoice shows a fee for a service outage—why?",
            "I need help understanding the prorated amount after I switched plans.",
            "My bill includes a $5 administrative fee—what’s that?",
            "Why am I being charged for paperless billing?",
            "I was promised a free month, but I’m still being billed.",
            "There’s a charge for a device insurance I never signed up for.",
            "My bill has a ‘service restoration’ fee—explain please.",
            "I was charged for a late payment even though I paid early.",
            "The amount due is higher than last month, any hidden fees?",
            "Can you remove the early termination fee? I’m within the grace period.",
            "Why does the bill show a “miscellaneous” charge?",
            "I see a charge for a voicemail service I never used.",
            "The billing cycle dates seem off—why was I billed twice?",
            "I was billed for a number I transferred out.",
            "My bill includes a “regulatory fee” that seems excessive.",
            "Why is there a $2.99 charge for a ringtone?",
            "I was told my plan includes free international calls, but I’m charged.",
            "The bill shows a “service activation” fee—what’s that for?",
            "I’m being charged for a speed boost I never requested.",
            "My statement has a “maintenance fee” I don’t recognize."
        ]
    },
    {
        "tag": "internet_issue",
        "patterns": [
            "My internet keeps dropping every few minutes.",
            "Why is my Wi‑Fi so slow today?",
            "I can't load any webpages on my laptop.",
            "The connection says 'No internet' even though the router is on.",
            "I'm paying for broadband but getting zero speed.",
            "My streaming keeps buffering despite a strong signal.",
            "Is there an outage in my area? My internet is down.",
            "The router rebooted itself and now nothing works.",
            "I tried resetting the modem but still no connection.",
            "My internet is super laggy; video calls are impossible.",
            "Why does my internet cut out right after I log in?",
            "I have a fiber line, but it's not delivering any data.",
            "My home office can't connect to the VPN.",
            "The speed test shows only 2 Mbps.",
            "I keep getting a 'Limited Access' warning on my PC.",
            "My internet works on mobile data but not on the home network.",
            "Can you check if there's a line fault at my address?",
            "The Wi‑Fi light on the router is red.",
            "I'm getting disconnected every time I try to download a file.",
            "My internet was fine yesterday, now it's gone.",
            "Why is my upload speed so low?",
            "The router says 'Internet not detected'.",
            "I need help, my internet is completely dead.",
            "My gaming console can't go online.",
            "The connection keeps resetting every few seconds.",
            "I'm frustrated, the internet is unreliable.",
            "Can you tell me why my internet is intermittent?",
            "My smart TV can't stream anything.",
            "The modem shows an error code 404.",
            "I'm seeing a 'No Service' message on my broadband.",
            "My internet works for a minute then drops.",
            "Why does the Wi‑Fi keep disconnecting on my phone?",
            "The speed keeps fluctuating wildly.",
            "I think there's a problem with the line outside my house.",
            "My internet is down, and I need it for work.",
            "The router's internet LED is off.",
            "I can't access any websites at all.",
            "My internet keeps timing out during video calls.",
            "There is a constant lag when I play online games.",
            "The broadband service is not responding.",
            "My internet connection is unstable after the storm.",
            "I keep getting 'Network unreachable' errors.",
            "The Wi‑Fi signal is strong but no internet.",
            "My internet stopped working after a power outage.",
            "Why is my data cap being hit so quickly? It feels like a connection issue.",
            "I'm experiencing random disconnects throughout the day.",
            "The router is rebooting itself repeatedly.",
            "My internet speed is far below what I'm paying for.",
            "I can't send or receive emails; the connection fails.",
            "The connection works on the phone but not on the laptop."
        ]
    },
    {
        "tag": "calls_issue",
        "patterns": [
            "I can't make any calls, what's wrong?",
            "My outgoing calls keep dropping after a few seconds.",
            "Why is my call quality so terrible today?",
            "I get a busy signal every time I try to call my mom.",
            "My phone says 'no service' when I try to dial.",
            "Can you help me with a one-way audio issue during calls?",
            "I'm hearing echo on every call I make.",
            "All my calls are being sent to voicemail automatically.",
            "Why does my call keep disconnecting right after I say hello?",
            "I can't hear the other person at all during calls.",
            "My call gets stuck on 'ringing' forever.",
            "I keep getting 'call failed' errors on my smartphone.",
            "The person I'm calling hears static noise.",
            "My international calls are not connecting.",
            "I'm being charged for failed calls that never went through.",
            "Why does my caller ID show the wrong number?",
            "I can't receive incoming calls on my new SIM.",
            "My call drops when I move out of the house.",
            "The call quality is horrible when I'm on Wi‑Fi calling.",
            "I keep hearing a beep tone before the call connects.",
            "My call gets transferred to a wrong number automatically.",
            "I was put on hold for 30 minutes and the call never resumed.",
            "Why does my call keep looping back to the start?",
            "I can't add a conference participant, they get a busy tone.",
            "My call volume is stuck at the lowest level.",
            "The call connects but I hear nothing on my end.",
            "My call was cut off after exactly 2 minutes each time.",
            "I get a 'network unavailable' message when trying to call.",
            "My call gets routed to a wrong department every time.",
            "I tried calling, but it says 'service temporarily unavailable'.",
            "Why does my call keep echoing back to me?",
            "I can't make calls from my tablet, only texts work.",
            "My call disconnects when I switch from 4G to 5G.",
            "I keep hearing a clicking sound during calls.",
            "My call was dropped right after I entered my PIN.",
            "Why does my call keep failing after I entered the number?",
            "I can't hear the ringtone when someone calls.",
            "My call shows as 'ended' but I was still talking.",
            "Every call I make is recorded, is that normal?",
            "I get a 'call blocked' message for numbers I know.",
            "My call keeps going to voicemail even though I'm online.",
            "I experience a delay of several seconds before the other side hears me.",
            "The call quality improves only when I move closer to a window.",
            "My call gets automatically muted after a few seconds.",
            "I can't add a contact to the call because it says 'not reachable'.",
            "Why does my call drop when I receive a text mid‑call?",
            "I'm hearing a faint background music during calls.",
            "My call fails when I try to use a VPN.",
            "The call connection says 'reconnecting' and never finishes.",
            "I get a 'call limit exceeded' error even though I haven't called much."
        ]
    },
    {
        "tag": "bundle_change",
        "patterns": [
            "I want to switch my data bundle to a larger one.",
            "Can I downgrade my current plan to a cheaper bundle?",
            "Please change my bundle to include unlimited texts.",
            "How do I add an extra 5GB to my package?",
            "I need to upgrade my voice minutes, can you help?",
            "My current bundle is too expensive, I want a cheaper option.",
            "Is it possible to combine my data and call bundles?",
            "I want to cancel the extra sports channel bundle.",
            "Switch my family bundle to the new promo plan.",
            "I’m not happy with my current bundle, can I get a different one?",
            "Help me change my bundle to the student discount plan.",
            "I need to add international calling to my bundle.",
            "Can I swap my current bundle for the weekend data boost?",
            "My data runs out too fast, I want a larger bundle.",
            "Please remove the extra streaming bundle from my account.",
            "I’d like to add a night-time data bundle.",
            "How can I change my bundle without extra fees?",
            "I want to keep my current bundle but add a music streaming add‑on.",
            "My bundle doesn’t include enough SMS, can it be increased?",
            "Switch me to the prepaid bundle, please.",
            "I’m moving abroad, can I change to an international bundle?",
            "Can you downgrade my voice bundle to 200 minutes?",
            "I want to activate the holiday data bundle.",
            "My bundle is showing the wrong amount of data, can it be fixed?",
            "Add a family sharing bundle to my account.",
            "I’d like to switch from a monthly to a weekly bundle.",
            "Please change my bundle to the new 10GB plan.",
            "Can I get a bundle that includes free roaming?",
            "I need to remove the extra TV channel bundle.",
            "Upgrade my bundle to include 2TB of cloud storage.",
            "My current bundle is missing the discount I was promised.",
            "I want a bundle that gives me more night data.",
            "Can I pause my current bundle and resume later?",
            "Switch my bundle to the business plan, please.",
            "I’d like to add a kids safety bundle.",
            "My bundle is set to auto‑renew, can I change that?",
            "Please replace my current bundle with the latest offer.",
            "I need a bundle that includes 1000 international minutes.",
            "Can I merge my two separate bundles into one?",
            "I want to cancel the extra data bundle I added yesterday.",
            "Add a data rollover bundle to my plan.",
            "My bundle doesn’t cover my new device, can it be adjusted?",
            "I’d like to switch to the pay‑as‑you‑go bundle.",
            "Can I get a bundle that includes free device insurance?",
            "Please downgrade my bundle to the basic plan.",
            "I need a bundle with unlimited data for a month.",
            "Switch my bundle to the promotional 5G plan.",
            "Can you remove the extra sports streaming bundle?",
            "I want to add a bundle for extra international SMS.",
            "Help me change my bundle to the new family discount offer."
        ]
    },
    {
        "tag": "balance_inquiry",
        "patterns": [
            "Can you tell me my current prepaid balance?",
            "What's my remaining data balance?",
            "I need to know how much credit I have left.",
            "Please check my balance.",
            "How much talk time do I have?",
            "Show me my balance, thanks.",
            "Balance inquiry, please.",
            "What's my current balance on my account?",
            "I want to see my remaining minutes.",
            "Could you give me my balance details?",
            "Check my balance for me.",
            "How much money is left on my prepaid plan?",
            "Tell me my data remaining.",
            "What is my current balance?",
            "I need my balance info ASAP.",
            "Balance status?",
            "Do I have enough credit for a call?",
            "How many megabytes do I have left?",
            "Give me my balance.",
            "What's my account balance right now?",
            "Can you show my remaining balance?",
            "Balance check.",
            "How much credit do I have left this month?",
            "I want to know my current balance.",
            "Please let me know my remaining talk time.",
            "What’s my balance?",
            "Check my prepaid balance.",
            "How much data do I have left?",
            "Show my balance please.",
            "Tell me how much credit I have.",
            "Balance of my account?",
            "Do I have enough balance for an international call?",
            "What's my remaining balance for this billing cycle?",
            "Can you pull up my balance?",
            "I’d like to see my balance.",
            "How much money is left on my line?",
            "Balance details, please.",
            "What’s my current talk time balance?",
            "Can you tell me my remaining balance?",
            "How much credit is left on my account?",
            "Show me my balance details.",
            "I need to know my balance before I top up.",
            "What's the balance on my SIM?",
            "How much data is left on my plan?",
            "Give me my current balance.",
            "Balance inquiry for my number.",
            "Do I have enough balance for a text?",
            "What's my remaining balance?",
            "Check my balance now.",
            "Check my balance now."
        ]
    },
    {
        "tag": "recharge",
        "patterns": [
            "I need to top up my prepaid plan.",
            "Can you add 20 dollars to my account?",
            "Please recharge my number with 100 rupees.",
            "How do I refill my data pack?",
            "I want to buy a new recharge package.",
            "My balance is low, can you top it up now?",
            "Give me a 500 MB data boost.",
            "I need a quick recharge, please.",
            "What's the fastest way to add credit?",
            "Add 50 units to my SIM.",
            "I want to recharge with a promo code.",
            "Help me reload my account.",
            "Can I get a recharge for 30 days?",
            "Top up my phone, I’m about to run out.",
            "I need a recharge, but my card is declined.",
            "Please apply the latest recharge offer.",
            "How much does a 1GB data recharge cost?",
            "I want to recharge using Paytm.",
            "Recharge my number with the festive discount.",
            "Can I schedule a monthly recharge?",
            "I’m stuck on the recharge page, help.",
            "Give me a recharge for unlimited calls.",
            "Need a recharge ASAP, my balance is zero.",
            "Add 10 dollars to my account, please.",
            "What are the recharge options for my plan?",
            "I want to use my reward points for a recharge.",
            "Please process a recharge for my family member.",
            "Can I get a recharge voucher?",
            "My last recharge didn’t go through.",
            "Help me choose the best recharge bundle.",
            "I’d like to recharge with a gift card.",
            "Is there a discount on weekend recharges?",
            "Recharge my prepaid line, I’m traveling.",
            "I need a data-only recharge.",
            "How do I check if my recharge was successful?",
            "Can I combine two recharges?",
            "I want a recharge that includes international calls.",
            "My recharge amount is wrong, please fix.",
            "Please activate the new recharge plan I bought.",
            "I need a recharge but I don’t have internet.",
            "Top up my phone using my bank account.",
            "Can you resend the recharge confirmation?",
            "I’m looking for a cheap recharge option.",
            "Please cancel my pending recharge.",
            "Do you have a recharge for students?",
            "I want to add extra data to my current plan.",
            "My recharge expired, can I reactivate?",
            "Is there a recharge limit per day?",
            "Help me apply a coupon to my recharge.",
            "I need to recharge my secondary SIM."
        ]
    },
    {
        "tag": "account_support",
        "patterns": [
            "I need to update my billing address, how can I do that?",
            "Can you tell me why my account was suspended?",
            "I'm having trouble logging into my online portal.",
            "Please reset my password; I forgot it.",
            "My credit card on file expired, what should I do?",
            "Why am I being charged extra this month?",
            "I want to close my account, what’s the process?",
            "How do I change my plan to a family package?",
            "My account shows a payment I didn’t make.",
            "I need a copy of my last invoice.",
            "Can you add a secondary user to my account?",
            "My account is locked after too many login attempts.",
            "I was double-charged for my last bill.",
            "Help me set up auto-pay for my monthly fees.",
            "I moved to a new address; update my service location.",
            "Why is my account balance still showing as unpaid?",
            "I want to switch my payment method to PayPal.",
            "My loyalty points haven’t been applied to my bill.",
            "I can’t see my data usage details in the app.",
            "Please verify my identity so I can make changes.",
            "My account shows a service outage that isn’t true.",
            "I need to add an international roaming add‑on.",
            "Can I get a temporary suspension while I’m abroad?",
            "My account number is missing from my email receipt.",
            "I was promised a discount but it isn’t reflected.",
            "How do I retrieve my old account statements?",
            "I’m being billed for a service I never activated.",
            "My account email is wrong, can you correct it?",
            "I want to upgrade to a higher data plan.",
            "Why does my bill have a late fee when I paid on time?",
            "I need to change the name on the account.",
            "My account shows a pending charge that never cleared.",
            "Can I get a detailed breakdown of my current charges?",
            "I’m unable to register for the loyalty program.",
            "My SIM card was replaced, but the account isn’t updated.",
            "Please cancel the extra line I added by mistake.",
            "I’m receiving phishing emails pretending to be from you.",
            "How can I set up account alerts for low balance?",
            "My account shows a service credit I never received.",
            "I want to merge two separate accounts I have.",
            "Why was my data cap reduced without notice?",
            "I need assistance with two‑factor authentication setup.",
            "My account shows a foreign transaction I didn’t make.",
            "Can I get a paper copy of my contract?",
            "I’m having trouble linking my account to the mobile app.",
            "Please explain the early termination fee on my contract.",
            "I want to add a new device to my family plan.",
            "My account shows an unknown device connected.",
            "How do I reactivate my account after a suspension?",
            "I need help verifying my billing zip code."
        ]
    },
    {
        "tag": "complaint",
        "patterns": [
            "My internet has been down for three days, this is unacceptable.",
            "Why am I still being charged for a plan I cancelled?",
            "The call quality is terrible, I can barely hear anything.",
            "I keep getting random extra fees on my bill.",
            "My data speed is far slower than what I'm paying for.",
            "I asked for a technician last week and still haven't heard back.",
            "The roaming charges on my last trip are outrageous.",
            "My prepaid balance disappeared after I topped up.",
            "The TV box keeps freezing on every channel.",
            "I was promised a discount, but it never applied.",
            "Your customer service line is always busy, I can't get help.",
            "I'm fed up with constant network outages in my area.",
            "My new SIM card never activated, despite the instructions.",
            "The app keeps crashing whenever I try to view my usage.",
            "I was overcharged for international calls I never made.",
            "My broadband keeps dropping every few minutes.",
            "I can't send texts, they always fail to deliver.",
            "The promotional offer I signed up for never showed up on my bill.",
            "My voicemail is not recording any messages.",
            "I was promised a free router, but I never received it.",
            "The billing cycle changed without any notice.",
            "My family plan is still billing me for an extra line I removed.",
            "I have been waiting for a refund for weeks, still nothing.",
            "The website says I have credit, but I can't use it.",
            "My 5G connection is as slow as 3G.",
            "I keep getting spam calls even after I registered on the do-not-disturb list.",
            "Your service outage map is inaccurate; I'm still without service.",
            "The contract renewal terms are hidden and confusing.",
            "I was told my issue would be resolved in 24 hours, it's been 3 days.",
            "My internet router keeps rebooting on its own.",
            "I can't access my account online; it says my password is incorrect.",
            "The promotional data boost never credited to my account.",
            "I'm being billed for a device I never purchased.",
            "My call forwarding feature doesn't work at all.",
            "The support chat closed abruptly before I got an answer.",
            "I was promised a free upgrade, but my plan hasn't changed.",
            "The SMS notifications are delayed by hours.",
            "My broadband installation appointment was missed without explanation.",
            "I'm still being charged for a service I never activated.",
            "The network congestion during peak hours makes video calls impossible.",
            "I received a bill for a month I was on a free trial.",
            "My SIM card was deactivated without warning.",
            "The loyalty points I earned never appeared on my account.",
            "I can't change my plan online; the system throws an error.",
            "My international roaming data limit reset incorrectly.",
            "The customer portal doesn't show my recent payments.",
            "I was told my complaint would be escalated, but I got no follow‑up.",
            "The promotional discount expired before I could use it.",
            "My broadband speed test shows 5 Mbps, not the 50 Mbps I pay for.",
            "The automated voice menu never lets me speak to a human."
        ]
    }
]